/*Створити клас Array, або використайте раніше створений вами. Array - це клас динамічного двовимірного масиву.

В класі передбачити деструктор та наступні конструктори:
Конструктор, який прийматиме значення та розмір і створить масив даного розміру та заповнить його переданим значенням
Конструктор копіювання для створення копії даних масива

Методи класу:
Показати вміст масиву
Добавити рядок до масиву
Знайти максимальний елемент в масиві
Знайти мінімальний елемент в масиві*/

#include<iostream>
#include<string>
#include"Array.h"

using namespace std;

ARRAY CreateArray()
{
	ARRAY arr = ARRAY(6,6);	// створення об'єкта за домопогою параметризваного конструктора
	arr.show();	// показати вміст масиву <----------------
	return arr;	// повернути створений об'єкт
}
int main()
{
	ARRAY obj(5,5);
	obj.show();
	cout << endl;
	obj.add_row();
	obj.show();
	cout << endl;
	cout<<obj.max_elem()<<endl;
	cout << obj.min_elem() << endl;

	//ARRAY obj2(5,5);
	//ARRAY obj3(obj2);//конструктор копіювання
	//obj3.show();	


	CreateArray().show();//<----------------

	system("pause");
	return 0;
}