#include<iostream>
#include<string>
#include<fstream>
#include"program.h"
using namespace std;
/*Реалізуйте програму, яка надає функціональність по роботі з файлами.
Додаток отримує у користувача шлях до файлу, після чого програма відображає інтерфейс по аналізу вмісту файлу.
Можливості інтерфейсу:
- Відображення вмісту файлу на екран;
- Пошук заданого рядка (за підсумками показувати статистику пошуку рядка по всьому файлу - кількість знайдених рядків);
- Заміна символа на новий символ (за підсумками показати статистику по заміні символів);
- Заміна рядка на новий рядок (за підсумками показати статистику по заміні рядків);
- Переворот вмісту файлу;
- Визначення кількості рядків в тексті файлу;
- Визначення кількості речень в тексті файлу;
- Визначення кількості слів в тексті файлу.

Використовуйте для роботи з файлами потоки, а для роботи з рядками клас string.*/
int main()
{
	string path;
	/*cout << "Enter path: ";
	cin >> path;
	system("cls");*/
	try
	{
	program obj("data.txt");
	obj.menu();
	}
	catch (char eror)
	{
		cout << eror << endl;
	}
	return 0;
}