/*Створити клас Array, або використайте раніше створений вами. Array - це клас динамічного двовимірного масиву.

В класі передбачити деструктор та наступні конструктори:
Конструктор, який прийматиме значення та розмір і створить масив даного розміру та заповнить його переданим значенням
Конструктор копіювання для створення копії даних масива

Методи класу:
Показати вміст масиву
Добавити рядок до масиву
Знайти максимальний елемент в масиві
Знайти мінімальний елемент в масиві*/

#include<iostream>
#include<string>
#include"Array.h"

using namespace std;

int main()
{
	ARRAY obj(4,5,5);
	obj.show();
	cout << endl;
	obj.add_row();
	obj.show();
	cout << endl;
	cout<<obj.max_elem()<<endl;
	cout << obj.min_elem() << endl;



	system("pause");
	return 0;
}